; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   red_block_1 brown_block_1 brown_block_2 brown_block_3 blue_block_1 red_block_2 red_block_3 - block
 )
 (:init (ontable red_block_1) (ontable brown_block_1) (on brown_block_2 red_block_1) (ontable brown_block_3) (on blue_block_1 brown_block_2) (on red_block_2 brown_block_3) (on red_block_3 red_block_2) (clear brown_block_1) (clear blue_block_1) (clear red_block_3) (handempty) (= (total-cost) 0))
 (:goal (and (clear brown_block_2)))
 (:constraints (sometime (holding blue_block_1)) (sometime-before (holding blue_block_1) (on brown_block_3 red_block_3)) (sometime (not (on red_block_2 red_block_3))) (sometime-after (not (on red_block_2 red_block_3)) (clear red_block_2)) (sometime (or (holding red_block_2) (not (ontable red_block_1)))) (sometime (or (ontable blue_block_1) (holding brown_block_3))) (sometime (or (ontable red_block_3) (holding red_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack red_block_3 red_block_2)
   deleted: (on red_block_3 red_block_2) (clear red_block_3) (handempty)
   added: (holding red_block_3) (clear red_block_2)
   goals met: 0 of 1
2. (putdown red_block_3)
   deleted: (holding red_block_3)
   added: (clear red_block_3) (handempty) (ontable red_block_3)
   goals met: 0 of 1
3. (unstack red_block_2 brown_block_3)
   deleted: (on red_block_2 brown_block_3) (clear red_block_2) (handempty)
   added: (holding red_block_2) (clear brown_block_3)
   goals met: 0 of 1
4. (putdown red_block_2)
   deleted: (holding red_block_2)
   added: (clear red_block_2) (handempty) (ontable red_block_2)
   goals met: 0 of 1
5. (pickup brown_block_3)
   deleted: (clear brown_block_3) (ontable brown_block_3) (handempty)
   added: (holding brown_block_3)
   goals met: 0 of 1
6. (stack brown_block_3 red_block_3)
   deleted: (clear red_block_3) (holding brown_block_3)
   added: (handempty) (clear brown_block_3) (on brown_block_3 red_block_3)
   goals met: 0 of 1
7. (unstack blue_block_1 brown_block_2)
   deleted: (on blue_block_1 brown_block_2) (clear blue_block_1) (handempty)
   added: (holding blue_block_1) (clear brown_block_2)
   goals met: 1 of 1
